class BecomeServiceProviderInfoModel {
  String title;
  String details;

  BecomeServiceProviderInfoModel({
    required this.title,
    required this.details,
  });
}

List<BecomeServiceProviderInfoModel> becomeServiceProviderInfoModel = [
  BecomeServiceProviderInfoModel(
      title: 'توسيع نطاق وصولك:',
      details:
          ' احصل على وصول إلى قاعدة عملاء كبيرة تبحث نشطًا عن خدمات المنزل. توفر منصتنا لك عملاء جاهزين لحجز خدماتك، مما يساعدك على توسيع نطاق وصولك ورؤية عملك.'),
  BecomeServiceProviderInfoModel(
      title: 'جدول زمني مرن:',
      details:
          'خذ السيطرة على جدولك الزمني واختر الوظائف التي تتناسب مع توافرك. سواء كنت تفضل العمل بدوام كامل أو جزئي، تتيح لك منصتنا تحديد ساعاتك الخاصة وإدارة أعمالك بكفاءة.'),
  BecomeServiceProviderInfoModel(
      title: 'دفعات موثوقة:',
      details:
          ' وداعًا لتأخيرات الدفع وعدم اليقين. نحن نضمن دفعات سريعة وآمنة لخدماتك، حتى تتمكن من التركيز على ما تفعله بشكل أفضل وتتمتع بالاستقرار المالي.'),
  BecomeServiceProviderInfoModel(
      title: 'بناء سمعتك:',
      details:
          ' قدِّم مهاراتك وابنِ سمعة قوية ضمن مجتمعنا. استلم تقييمات وآراء من العملاء المرضى، مما يعزز مصداقيتك ويجذب المزيد من العملاء في العملية.'),
  BecomeServiceProviderInfoModel(
      title: 'مجتمع داعم:',
      details:
          'انضم إلى مجتمع من المحترفين الذين يشتركون في نفس الرؤية والتفاني لتقديم خدمة استثنائية. استفد من الدعم المستمر والتوجيه والموارد لتعزيز مهاراتك ونمو'),
];

List<BecomeServiceProviderInfoModel> aboutTheApp = [
  BecomeServiceProviderInfoModel(
      title: 'handyman ما هو تطبيق ',
      details:
          '''تطبيق home handy هو أفضل طريقة للقيام بجميع األعمال المنزلية الخاصة بك! 
إذا كنت تبحث عن فني أو كهربائي أو سباك من ذوي المهارات العالية لحل مشاكل 
السباكة أو الكهرباء، فإن تطبيق home Handy هو أفضل تطبيق! كما نوفر لك 
خدمات صيانة التكييف بما في ذلك تنظيف أي مكيف سواء مكيف سبليت أو تكييف
مركزي ودهانات وورق حائط ونجارة وتركيب أثاث ايكيا وتركيب اللوحات والستائر 
والتلفزيون والمرايا وتنظيف المنزل ، مكافحة الحشرات. تطبيق home handy
يجعلك تشعر بالراحة.'''),
  BecomeServiceProviderInfoModel(
      title: 'ما الذي يميز التطبيق',
      details:
          '''✓أفضل محترفي الخدمة في مدينتك الختيار األنسب لخدمتك بنا ًء على نظام تقييم ومراجعة لكل مقدم خدمة.
✓أسعار رائعة وعروض دائمة.
✓ضمان يصل إلى 30 يو ًما )شهر واحد( على الخدمات.
✓نظام حجز فوري مرن وسهل. اختر الوقت الذي يناسبك وابشر بما يخدمك.'''),
  BecomeServiceProviderInfoModel(
      title: 'الميزات الرئيسية للتطبيق',
      details:
          '''• شبكة مزودي الخدمة: يحتفظ التطبيق بقاعدة بيانات أو شبكة من مزودي الخدمة المعتمدين والمسجلين ، بما في 
ذلك المقاولون ، وخدمات العامل الماهر ، والسباكين ، والكهربائيين ، والنجارين ، والرسامين ، وتنسيق الحدائق 
، وغيرهم من المهنيين المهرة الذين يقدمون خدمات منزلية متنوعة.
• طلب الخدمة وجدولتها: يمكن للمستخدمين تقديم طلبات الخدمة من خالل التطبيق ، مع تحديد طبيعة الخدمة 
المطلوبة ، والتاريخ والوقت المفضلين ، وأي تفاصيل إضافية. يسهل التطبيق جدولة وتنسيق المواعيد بين 
المستخدمين ومقدمي الخدمة.
• التقييمات والمراجعات: يمكن للمستخدمين تقديم التعليقات والتقييمات والمراجعات بنا ًء على تجاربهم مع مزودي
الخدمة ، مما يسمح للمستخدمين اآلخرين باتخاذ قرارات مستنيرة عند اختيار مزود الخدمة.
• اإلخطارات والتحديثات: يتلقى المستخدمون اإلخطارات والتحديثات فيما يتعلق بحالة طلبات الخدمة وتأكيدات
المواعيد وأي تغييرات أو تحديثات من مزودي الخدمة.'''),
];

List<BecomeServiceProviderInfoModel> usesPolices = [
  BecomeServiceProviderInfoModel(
      title: 'أهلية المستخدم',
      details:
          '''تطبيقنا مخصص لالستخدام من قبل األفراد الذين ال تقل أعمارهم عن 18 عا ًما. باستخدام تطبيقنا ، فإنك تؤكد
أنك تبلغ من العمر 20 عا ًما أو أكثر. إذا كنت تستخدم التطبيق نيابة عن منظمة أو كيان ، فإنك تقر وتضمن أن
لديك السلطة إللزام تلك المنظمة أو الكيان بسياسة االستخدام هذه.'''),
  BecomeServiceProviderInfoModel(
      title: 'حساب المستخدم',
      details:
          '''للوصول إلى بعض الميزات والخدمات التي يوفرها تطبيقنا ، قد تحتاج إلى إنشاء حساب مستخدم. أنت مسؤول 
عن الحفاظ على سرية معلومات حسابك وعن جميع األنشطة التي تحدث ضمن حسابك. أنت توافق على تقديم 
معلومات دقيقة وحديثة عند إنشاء حسابك وصيانته.'''),
  BecomeServiceProviderInfoModel(
      title: 'الخصوصية',
      details:
          '''ونحن ملتزمون بحماية خصوصيتك. تم وصف ممارسات الخصوصية الخاصة بنا في سياسة الخصوصية 
الخاصة بنا ، والتي تم دمجها في سياسة االستخدام هذه عن طريق اإلشارة إليها. باستخدام تطبيقنا ، فإنك توافق 
على جمعنا لمعلوماتك واستخدامها ومشاركتها كما هو موضح في سياسة الخصوصية.'''),
];

List<BecomeServiceProviderInfoModel> privacyPolice = [
  BecomeServiceProviderInfoModel(
      title: 'سياسة خصوصية تطبيق home h',
      details:
          '''تحكم سياسة الخصوصية هذه الطريقة التي يقوم بها تطبيق الخدمات المنزلية الخاص بنا بجمع المعلومات التي يتم جمعها من 
مستخدمي التطبيق واستخدامها وصيانتها والكشف عنها. تنطبق هذه السياسة على التطبيق وجميع الخدمات المقدمة من خالله.
المعلومات التي نجمعها:
1 المعلومات الشخصية: قد نقوم بجمع المعلومات الشخصية من المستخدمين ، بما في ذلك على سبيل المثال ال الحصر ، 
األسماء وعناوين البريد اإللكتروني وأرقام الهواتف وعناوين المنازل ، عندما يسجل المستخدمون حسابًا أو يقدمون طلبات 
الخدمة أو يتفاعلون بطريقة أخرى مع ميزات التطبيق.
1.2 المعلومات المتعلقة بالخدمة: قد نقوم بجمع المعلومات المتعلقة بالخدمات التي يطلبها المستخدمون ، بما في ذلك تفضيالت 
الخدمة وأوصاف الصيانة أو المهام الحرفية وأي تفاصيل إضافية.
'''),
  BecomeServiceProviderInfoModel(
      title: 'استخدام المعلومات التي تم جمعها',
      details:
          '''تقديم الخدمات: نستخدم المعلومات التي تم جمعها لمعالجة طلبات الخدمة والوفاء بها ، وربطك بمزودي الخدمة ، وتسهيل 
االتصال بين المستخدمين ومقدمي الخدمة.
تحسين التطبيق: قد نستخدم المعلومات لتحليل أنماط االستخدام ، واستكشاف المشكالت الفنية وإصالحها ، وتحسين الوظائف 
وتجربة المستخدم لتطبيقنا.
جهة االتصال: قد نستخدم معلومات االتصال الخاصة بك إلرسال رسائل إدارية وتحديثات متعلقة بالخدمة ومواد ترويجية. 
يمكنك إلغاء االشتراك في تلقي االتصاالت الترويجية في أي وقت.
'''),
  BecomeServiceProviderInfoModel(
      title: 'أمن البيانات',
      details:
          '''نحن نستخدم تدابير أمنية معقولة لحماية معلوماتك الشخصية من الوصول غير المصرح به أو الكشف أو التغيير أو اإلتالف. 
ومع ذلك ، ال توجد وسيلة نقل أو تخزين إلكترونية آمنة بنسبة .٪100 لذلك ، ال يمكننا ضمان األمان المطلق لمعلوماتك.'''),
  BecomeServiceProviderInfoModel(
      title: 'االحتفاظ بالبيانات',
      details:
          '''سنحتفظ بمعلوماتك الشخصية طالما كان ذلك ضروريًا لتحقيق األغراض الموضحة في سياسة الخصوصية هذه ، ما لم يتطلب 
القانون فترة احتفاظ أطول أو يسمح بها.'''),
];

List<BecomeServiceProviderInfoModel> faqText = [
  BecomeServiceProviderInfoModel(
      title: 'كيف ستتم طريقة الدفع؟',
      details:
          '''حاليًا ، يتم الدفع لمزود الخدمة نقدًا فقط ، وستتم إضافة ميزة الدفع المتعددة عبر بطاقة االئتمان قريبًا.
'''),
  BecomeServiceProviderInfoModel(
      title: 'لماذا أستخدم تطبيق handy home؟',
      details:
          '''يسهل منزلك العملي على أصحاب المنازل والمؤسسات التجارية الحصول على حزمة من الخدمات المتعددة بأقل جهد وفي 
الوقت المناسب وبأسعار تنافسية مع ضمان العمل.'''),
  BecomeServiceProviderInfoModel(
      title: 'كيف يرفع تطبيقنا من مستوى جودة األعمال؟',
      details:
          '''من خالل مراجعة نظام التقييم الخاص بالتطبيق ، يقوم التطبيق تلقائيًا بإزالة أي مزود خدمة يقل تقييمه عن 3.5 من 5 ، ويقوم 
بمراجعة تقييمات العمالء وآرائك حول أي مزود خدمة للتحسين المستمر. العمالء هم صناع القرار وليس التطبيق.'''),
  BecomeServiceProviderInfoModel(
      title: 'هل توجد رسوم إضافية للخدمة عند استخدام التطبيق؟',
      details:
          '''ل ، التطبيق مجاني للعمالء وجميع أسعار الخدمات تنافسية ، وقد تكون أقل للعميل عند طلبه من التطبيق بدالً من التواصل
مع مزود الخدمة مباشرة ، من خالل قائمة األسعار التقريبية الموحدة لكل خدمة.'''),
  BecomeServiceProviderInfoModel(
      title: 'هل يوجد ضمان على العمل؟',
      details:
          '''نعم ، يتعهد جميع مزودي الخدمة لدينا بتقديم ضمان لخدماتهم للعمالء ، وفقً مان الخدمة المحدد. ا لشروط وأحكام التطبيق وض
في حالة عدم امتثال مزود الخدمة للضمان، يرجى االتصال بنا، حيث سيقوم فريق التطبيق بمراجعة األمر وإزالة مزود 
بنا ًء لخدمة على المنصة.. الخدمة من التطبيق. على رأيك'''),
];

List<BecomeServiceProviderInfoModel> callApp = [
  BecomeServiceProviderInfoModel(
      title: 'Gmail', details: '''handyhome@gmail.com'''),
  BecomeServiceProviderInfoModel(
      title: 'Whastapp', details: '''+972592663280'''),
  BecomeServiceProviderInfoModel(
      title: 'linkedIn', details: '''@handyhomeapp'''),
];
